# DuctLiningType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctLiningType Class
Members See Also
---
This class represents a duct lining type in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class DuctLiningType : ElementType
```

Visual Basic
---
```text
Public Class DuctLiningType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class DuctLiningType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Mechanical..::..DuctLiningType
# See Also
DuctLiningType Members
Autodesk.Revit.DB.Mechanical Namespace